# pip install pandas

In [1]:
import pandas as pd

In [3]:
df = pd.read_csv("facultate.csv")
df

   idStudent       nume  prenume  grupa  email       data_incrierii     statut
0          1  Andreescu   Andrei    NaN    NaN  2026-02-10 19:42:35  neevaluat
1          2  Andreescu  Andreea    NaN    NaN  2026-02-10 19:43:11  neevaluat
2          4    Ionescu   Andrei    NaN    NaN  2026-02-10 19:43:45  neevaluat

In [4]:
df = pd.read_csv("facultate.csv", index_col="idStudent")
df

                nume  prenume  grupa  email       data_incrierii     statut
idStudent
1          Andreescu   Andrei    NaN    NaN  2026-02-10 19:42:35  neevaluat
2          Andreescu  Andreea    NaN    NaN  2026-02-10 19:43:11  neevaluat
4            Ionescu   Andrei    NaN    NaN  2026-02-10 19:43:45  neevaluat

In [5]:
df.describe()

       grupa  email
count    0.0    0.0
mean     NaN    NaN
std      NaN    NaN
min      NaN    NaN
25%      NaN    NaN
50%      NaN    NaN
75%      NaN    NaN
max      NaN    NaN

In [6]:
df.dtypes

nume               object
prenume            object
grupa             float64
email             float64
data_incrierii     object
statut             object
dtype: object